# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle

# Make macOS more linux-y
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'gzip'
brew 'watch'
brew 'tmux'
brew 'wget'

# More utils
brew 'nmap'
brew 'gpg'
brew 'htop'
brew 'tree'
brew 'fzf'
brew 'bat'
brew 'exa'

# Zsh
brew 'zsh'
tap 'homebrew/cask-fonts'
cask 'font-meslo-lg-dz'

# Dev
brew 'git'
brew 'jq'

# Dev/Cloud
brew 'awscli'
cask 'google-cloud-sdk'
brew 'azure-cli'

# HashiCorp
tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'hashicorp/tap/consul'
brew 'hashicorp/tap/nomad'

# Dev/Containers
brew 'kubernetes-cli' # i.e. kubectl
brew 'helm'
# cask 'docker'
# cask 'rancher'

# Dev/Vagrant/Virtualization
# cask 'vagrant'
# Virtualization will trigger a macOS security alert
# as they often add their own network interfaces.
# Will have to be allowed (in System Preferences) and re-run.
# cask 'virtualbox'
# cask 'multipass'

# Dev/Python
# a) virtualenv way:
# PIP_REQUIRE_VIRTUALENV="false" pip install virtualenv
# PIP_REQUIRE_VIRTUALENV="false" pip3 install virtualenv
# virtualenv -p python <name> # or:
# virtualenv -p python3 <name>
# b) pyenv way:
# pyenv install <python version>
# pyenv virtualenv <python version> <name>
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Dev/Ruby
# https://github.com/rbenv/rbenv#command-reference
# rbenv init
# rbenv install <version>
# echo '<version>' > .ruby-version
# gem install bundler
brew 'rbenv'

# Java 8 (JRE)
# cask 'homebrew/cask-versions/java8'

# Misc
brew 'screenfetch'
brew 'peco'
