# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle

# Cask macOS apps
cask '1password'
cask 'iterm2'
cask 'typora'
cask 'chromium'
cask 'firefox'
cask 'authy'
cask 'microsoft-teams'
cask 'zoom'
cask 'visual-studio-code'
cask 'slack'
cask 'monodraw'

# Cask macOS utils
cask 'moom'
cask 'appcleaner'
cask 'balenaetcher'
cask 'the-unarchiver'
cask 'geekbench'
