# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle

# Command-Line Mac App Store
# NB: Sign in the macOS App Store beforehand
brew 'mas'
mas 'Slack', id: 803453959
mas 'Bear', id: 1091189122
mas 'Monodraw', id: 920404675
mas 'Moom', id: 419330170

# Cask macOS apps
cask '1password'
cask 'iterm2'
cask 'typora'
cask 'chromium'
cask 'firefox'
cask 'authy'
cask 'microsoft-teams'
cask 'zoom'

# Cask macOS utils
cask 'appcleaner'
cask 'balenaetcher'
cask 'the-unarchiver'
cask 'geekbench'
