bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
coolbear.systemd-unit-file
eamodio.gitlens
golang.go
GrapeCity.gc-excelviewer
hashicorp.terraform
James-Yu.latex-workshop
jumpinjackie.vscode-map-preview
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
ms-mssql.mssql
ms-python.python
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
redhat.java
redhat.vscode-yaml
scala-lang.scala
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wholroyd.jinja
zxh404.vscode-proto3
