dawhite.mustache
dnicolson.binary-plist
GitHub.copilot
hashicorp.hcl
hashicorp.terraform
James-Yu.latex-workshop
joedevivo.vscode-circuitpython
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
PascalReitermann93.vscode-yaml-sort
redhat.vscode-yaml
searKing.preview-vscode
shuworks.vscode-table-formatter
zxh404.vscode-proto3
