dawhite.mustache
hashicorp.terraform
James-Yu.latex-workshop
joedevivo.vscode-circuitpython
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
redhat.vscode-yaml
searKing.preview-vscode
shuworks.vscode-table-formatter
zxh404.vscode-proto3
